from aiogram import Router, F
from aiogram.types import CallbackQuery

router = Router()

@router.callback_query(F.data == "speaker_info")
async def speaker_info_handler(callback: CallbackQuery):
    # Показываем картинку и текст о спикере
    await callback.message.answer_photo(
        photo="https://image2url.com/images/1763964646699-74dde895-3472-407b-bf15-37b6b97df485.jpg"
    )
    text = (
        "🎯 Алексей Левин - руководитель проектов в области искусственного интеллекта и цифровой трансформации бизнеса.\n"
        "Магистр Московского технического университета связи и информатики по направлению «Архитектура информационных систем».\n"
        "💡 Экспертиза:\n"
        "Цифровая трансформация бизнеса:\n"
        "Внедрение ИИ-решений на базе LLM для автоматизации бизнес процессов - от разработки чат-ботов до создания IT-проектов. Реализация проектов с использованием RPA и систем на базе LLM для автоматизации рутинных бизнес-операций.\n"
        "Голосовые AI-ассистенты:\n"
        "Создание интеллектуальных голосовых ботов для автоматизации коммуникации с клиентами и сотрудниками - технологии, которые работают за вас 24/7.\n"
        "Компьютерное зрение:\n"
        "Разработка решений для контроля качества и безопасности производственных процессов. Построение ML-моделей для прогнозирования спроса и оптимизации складских запасов.\n"
        "Автоматизация FD:\n"
        "Интеграция RPA-роботов для автоматизации бухгалтерских и финансовых процессов - точность и скорость без человеческого фактора.\n"
        "Образовательные AI-инструменты\n"
        "Создание виртуальных 3D-аватаров, AI-репетиторов и геймифицированных учебных платформ.\n"
        "🚀 Фокус: повышение эффективности бизнеса через AI и автоматизацию. Создание масштабируемых решений, которые действительно работают и приносят измеримую пользу."
    )
    await callback.message.answer(text)
